Repository: bitbird-dev/Bitbird.Core
Catalog: Bitbird.Core/ApiErrors/ApiErrorMessages.*.resx
Languages: de

# ApiCannotProcessFurtherError_Message
source: The execution cannot process further. Previous errors are most likely preventing further execution. Details: {0}
de: Die weitere Ausführung kann nicht ausgeführt werden. Wahrscheinlich verhindern vorangegangene Fehler das weitere Verarbeiten der Daten. Details: {0}.

# ApiCannotProcessFurtherError_Title
source: Cannot process further.
de: Die weitere Ausführung kann nicht ausgeführt werden.

# ApiErrorType_MustBeUnique_Title
source: Must be unique.
de: Muss eindeutig sein.

# ApiErrorException_Message
source: API errors have occurred (Details: {{ {0} }}).
de: API Fehler sind aufgetreten. (Details : {{ {0} }}).

# ApiEntityError_Title
source: Entity error
de: Entitätenfehler

# ApiAttributeMustBeUniqueError_Title
source: The {0} '{1}' already exists.
de: Es besteht bereits ein anderer Eintrag, der das Feld {0} auf '{1}' gesetzt hat.

# ApiAttributeError_Title
source: Attribute error.
de: Attributfehler.

# ApiVersionMismatchError_Title
source: API version missmatch.
de: Nicht kompatible API-Version.

# ApiVersionMismatchError_Message
source: The requested interface version is not supported (Requested version: {0}, Supported version: {1}).
de: Die Schnittstellenversion des Servers weicht von der erwarteten Version ab (Erwartete Version: {0}, Server Version: {1}).

# ApiUserIsLockedError_Title
source: The user is locked.
de: Der Benutzer ist gesperrt.

# ApiUserIsLockedError_Message
source: The user is currently locked. Contact your administrator.
de: Der Benutzer ist derzeit gesperrt. Kontaktieren Sie Ihren Administrator.

# ApiUserIsInActiveError_Title
source: The user is inactive.
de: Der Benutzer ist inaktiv.

# ApiUserIsInActiveError_Message
source: The user is currently inactive. Contact your administrator.
de: Der Benutzer ist derzeit inaktiv. Kontaktieren Sie Ihren Administrator.

# ApiUserAuthInactiveError_Title
source: Authentication inactive.
de: Anmeldemethode inaktiv.

# ApiUserAuthInactiveError_Message
source: This authentication method is inactive (Reason: {0}).
de: Die Anmeldemethode ist für den Benutzer nicht aktiv (Grund: {0}).

# ApiUserAuthInactiveError_Message_NoReason
source: No details available.
de: Keine Details verfügbar.

# ApiPreconditionError_Title
source: Precondition violated.
de: Vorbedingung nicht erfüllt.

# ApiParameterError_Title
source: Parameter error.
de: Parameterfehler.

# ApiOptimisticLockingError_Title
source: Optimistic locking error.
de: Fehler beim optimistischen Sperren.

# ApiNotFoundError_Title
source: Not found.
de: Nicht gefunden.

# ApiNotFoundError_Message
source: A {0} with the given identifier could not be found (identifier='{1}', identifier info='{2}').
de: Ein {0}-Eintrag mit der Identifikation konnte nicht gefunden werden (Identifikation: '{1}', Identifikationsinfo: '{2}').

# ApiNotFoundError_Message_NoIdentifierInfo
source: Primary key
de: Primärschlüssel

# ApiInvalidCredentialsError_Title
source: Invalid credentials.
de: Ungültige Anmeldungsinformation.

# ApiInvalidCredentialsError_Message
source: The provided credentials are invalid (Details: {0}).
de: Die Anmeldeinformationen sind fehlerhaft (Details: {0}).

# ApiForbiddenNoRightsError_Title
source: Insufficient rights.
de: Keine Rechte.

# ApiForbiddenNoRightsError_Message
source: The current session does not have the right to perform this action (Action description: {0}).
de: Die aktuelle Sitzung hat keine Rechte um diese Aktion durchzuführen (Aktionsbeschreibung: {0}).

# ApiForbiddenNoLoginError_Title
source: Not logged in.
de: Nicht eingeloggt.

# ApiForbiddenNoLoginError_Message
source: The current session is not logged in.
de: Die aktuelle Sitzung ist nicht eingeloggt.
